<?php

use Illuminate\Database\Seeder;

class AchievmentSeeder extends Seeder
{
    protected $achievement = [
        [
            'image' => '/images/achievement/Frame.png',
            'name_ru'=>'Награда за регистрацию в проекте',
            'name_en'=>'Награда за регистрацию в проекте',
            'name_blr'=>'Награда за регистрацию в проекте',
            'description_ru'=>'Награда за регистрацию в проекте',
            'description_en'=>'Награда за регистрацию в проекте',
            'description_blr'=>'Награда за регистрацию в проекте',
        ],
        [
            'image' => '/images/achievement/Frame1.png',
            'name_ru'=>'Награда после первой пройденной тренировки',
            'name_en'=>'Награда после первой пройденной тренировки',
            'name_blr'=>'Награда после первой пройденной тренировки',
            'description_ru'=>'Награда после первой пройденной тренировки',
            'description_en'=>'Награда после первой пройденной тренировки',
            'description_blr'=>'Награда после первой пройденной тренировки',
        ],
        [
            'image' => '/images/achievement/Frame2.png',
             'name_ru'=>'Награда за пройденные две тренировки за день',
            'name_en'=>'Награда за пройденные две тренировки за день',
            'name_blr'=>'Награда за пройденные две тренировки за день',
            'description_ru'=>'Награда за пройденные две тренировки за день',
            'description_en'=>'Награда за пройденные две тренировки за день',
            'description_blr'=>'Награда за пройденные две тренировки за день',
        ],
        [
            'image' => '/images/achievement/Frame3.png',
             'name_ru'=>'Награда за пройденные три тренировки за день;',
            'name_en'=>'Награда за пройденные три тренировки за день;',
            'name_blr'=>'Награда за пройденные три тренировки за день;',
            'description_ru'=>'Награда за пройденные три тренировки за день;',
            'description_en'=>'Награда за пройденные три тренировки за день;',
            'description_blr'=>'Награда за пройденные три тренировки за день;',
        ],
        [
            'image' => '/images/achievement/Frame4.png',
             'name_ru'=>'Награда после пройденной программы',
            'name_en'=>'Награда после пройденной программы',
            'name_blr'=>'Награда после пройденной программы',
            'description_ru'=>'Награда после пройденной программы',
            'description_en'=>'Награда после пройденной программы',
            'description_blr'=>'Награда после пройденной программы',
        ],
        [
            'image' => '/images/achievement/Frame5.png',
             'name_ru'=>'Награда после трех пройденных программ',
            'name_en'=>'Награда после трех пройденных программ',
            'name_blr'=>'Награда после трех пройденных программ',
            'description_ru'=>'Награда после трех пройденных программ',
            'description_en'=>'Награда после трех пройденных программ',
            'description_blr'=>'Награда после трех пройденных программ',
        ],
        [
            'image' => '/images/achievement/Frame6.png',
             'name_ru'=>'Награда после пяти пройденных программ',
            'name_en'=>'Награда после пяти пройденных программ',
            'name_blr'=>'Награда после пяти пройденных программ',
            'description_ru'=>'Награда после пяти пройденных программ',
            'description_en'=>'Награда после пяти пройденных программ',
            'description_blr'=>'Награда после пяти пройденных программ',
        ],
        [
            'image' => '/images/achievement/Frame7.png',
             'name_ru'=>'Награда за месяц с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'name_en'=>'Награда за месяц с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'name_blr'=>'Награда за месяц с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'description_ru'=>'Награда за месяц с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'description_en'=>'Награда за месяц с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'description_blr'=>'Награда за месяц с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
        ],
        [
            'image' => '/images/achievement/Frame8.png',
             'name_ru'=>'Награда за 6 месяцев с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'name_en'=>'Награда за 6 месяцев с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'name_blr'=>'Награда за 6 месяцев с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'description_ru'=>'Награда за 6 месяцев с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'description_en'=>'Награда за 6 месяцев с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'description_blr'=>'Награда за 6 месяцев с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
        ],
        [
            'image' => '/images/achievement/Frame9.png',
             'name_ru'=>'Награда за 12 месяцев с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'name_en'=>'Награда за 12 месяцев с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'name_blr'=>'Награда за 12 месяцев с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'description_ru'=>'Награда за 12 месяцев с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'description_en'=>'Награда за 12 месяцев с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
            'description_blr'=>'Награда за 12 месяцев с нами, пользователь хотя бы раз в месяц обязан зайти в систему, чтобы получить данную программу',
        ],
        [
            'image' => '/images/achievement/Frame10.png',
            'name_ru'=>'Награда за первые 3000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'name_en'=>'Награда за первые 3000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'name_blr'=>'Награда за первые 3000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'description_ru'=>'Награда за первые 3000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'description_en'=>'Награда за первые 3000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'description_blr'=>'Награда за первые 3000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
        ],
        [
            'image' => '/images/achievement/Frame11.png',
             'name_ru'=>'Награда за первые 10000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'name_en'=>'Награда за первые 10000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'name_blr'=>'Награда за первые 10000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'description_ru'=>'Награда за первые 10000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'description_en'=>'Награда за первые 10000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'description_blr'=>'Награда за первые 10000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
        ],
        [
            'image' => '/images/achievement/Frame12.png',
             'name_ru'=>'Награда за первые 50000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'name_en'=>'Награда за первые 50000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'name_blr'=>'Награда за первые 50000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'description_ru'=>'Награда за первые 50000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'description_en'=>'Награда за первые 50000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
            'description_blr'=>'Награда за первые 50000 сожжённых калорий на тренировках, которые высчитываются как сумма сожжённых калорий от всех тренировок',
        ],
    ];

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        foreach ($this->achievement as $item){

            \App\Model\Achievement::create($item);
        }
    }
}
