<?php

use Illuminate\Database\Seeder;

class ClientCommentSeeder extends Seeder
{
    public $comments = [
      [
         'user_name_ru'=>'Даша Малалотева',
         'user_name_en'=>'Даша Малалотева',
         'user_name_blr'=>'Даша Малалотева',
          'text_ru'=>'Оценка курсу 10. Курс закончился недавно. Себе в ежедневник выписала последние тренировки и все задания по сну и питанию. Со сном и питанием еще справляюсь, а вот с тренировками проблема. Вышла на работу , после работы приезжаю и не получается выкроить время. Но делаю хоть отдельные упражнения или кардио. На работе делаю упражнения у стены, когда плечи устают. ',
          'text_en'=>'Оценка курсу 10. Курс закончился недавно. Себе в ежедневник выписала последние тренировки и все задания по сну и питанию. Со сном и питанием еще справляюсь, а вот с тренировками проблема. Вышла на работу , после работы приезжаю и не получается выкроить время. Но делаю хоть отдельные упражнения или кардио. На работе делаю упражнения у стены, когда плечи устают. ',
          'text_blr'=>'Оценка курсу 10. Курс закончился недавно. Себе в ежедневник выписала последние тренировки и все задания по сну и питанию. Со сном и питанием еще справляюсь, а вот с тренировками проблема. Вышла на работу , после работы приезжаю и не получается выкроить время. Но делаю хоть отдельные упражнения или кардио. На работе делаю упражнения у стены, когда плечи устают. ',
          'image'=>'/images/clientComment/comment_little.png'
      ],
        [
            'user_name_ru'=>'Данил Малалотева',
            'user_name_en'=>'Данил Малалотева',
            'user_name_blr'=>'Данил Малалотева',
            'text_ru'=>' 10. Курс закончился недавно. Себе в ежедневник выписала последние тренировки и все задания по сну и питанию. Со сном и питанием еще справляюсь, а вот с тренировками проблема. Вышла на работу , после работы приезжаю и не получается выкроить время. Но делаю хоть отдельные упражнения или кардио. На работе делаю упражнения у стены, когда плечи устают. ',
            'text_en'=>'Оценка курсу 10. . Себе в ежедневник выписала последние тренировки и все задания по сну и питанию. Со сном и питанием еще справляюсь, а вот с тренировками проблема. Вышла на работу , после работы приезжаю и не получается выкроить время. Но делаю хоть отдельные упражнения или кардио. На работе делаю упражнения у стены, когда плечи устают. ',
            'text_blr'=>'. Курс закончился недавно. Себе в ежедневник выписала последние тренировки и все задания по сну и питанию. Со сном и питанием еще справляюсь, а вот с тренировками проблема. Вышла на работу , после работы приезжаю и не получается выкроить время. Но делаю хоть отдельные упражнения или кардио. На работе делаю упражнения у стены, когда плечи устают. ',
            'image'=>'/images/clientComment/comment_little1.png'

        ],
        [
            'user_name_ru'=>'Лера Малалотева',
            'user_name_en'=>'Лера Малалотева',
            'user_name_blr'=>'Лера Малалотева',
            'text_ru'=>'Лера Лера Оценка курсу 10. Курс закончился недавно. Себе в ежедневник выписала последние тренировки и все задания по сну и питанию. Со сном и питанием еще справляюсь, а вот с тренировками проблема. Вышла на работу , после работы приезжаю и не получается выкроить время. Но делаю хоть отдельные упражнения или кардио. На работе делаю упражнения у стены, когда плечи устают. ',
            'text_en'=>'Лера Лера ЛераОценка курсу 10. Курс закончился недавно. Себе в ежедневник выписала последние тренировки и все задания по сну и питанию. Со сном и питанием еще справляюсь, а вот с тренировками проблема. Вышла на работу , после работы приезжаю и не получается выкроить время. Но делаю хоть отдельные упражнения или кардио. На работе делаю упражнения у стены, когда плечи устают. ',
            'text_blr'=>'Лера Лера Лера Лера Оценка курсу 10. Курс закончился недавно. Себе в ежедневник выписала последние тренировки и все задания по сну и питанию. Со сном и питанием еще справляюсь, а вот с тренировками проблема. Вышла на работу , после работы приезжаю и не получается выкроить время. Но делаю хоть отдельные упражнения или кардио. На работе делаю упражнения у стены, когда плечи устают. ',
            'image'=>'/images/clientComment/comment_little2.png'

        ],
        [
            'user_name_ru'=>'Оля Малалотева',
            'user_name_en'=>'Оля Малалотева',
            'user_name_blr'=>'Оля Малалотева',
            'text_ru'=>'Оля  курсу 10. Курс закончился недавно. Себе в ежедневник выписала последние тренировки и все задания по сну и питанию. Со сном и питанием еще справляюсь, а вот с тренировками проблема. Вышла на работу , после работы приезжаю и не получается выкроить время. Но делаю хоть отдельные упражнения или кардио. На работе делаю упражнения у стены, когда плечи устают. ',
            'text_en'=>'Оля   курсу 10. Курс закончился недавно. Себе в ежедневник выписала последние тренировки и все задания по сну и питанию. Со сном и питанием еще справляюсь, а вот с тренировками проблема. Вышла на работу , после работы приезжаю и не получается выкроить время. Но делаю хоть отдельные упражнения или кардио. На работе делаю упражнения у стены, когда плечи устают. ',
            'text_blr'=>'Оля курсу 10. Курс закончился недавно. Себе в ежедневник выписала последние тренировки и все задания по сну и питанию. Со сном и питанием еще справляюсь, а вот с тренировками проблема. Вышла на работу , после работы приезжаю и не получается выкроить время. Но делаю хоть отдельные упражнения или кардио. На работе делаю упражнения у стены, когда плечи устают. ',
            'image'=>'/images/clientComment/comment_little3.png'

        ],
    ];
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        foreach ($this->comments as $comment){
            \App\Model\ClientComment::create($comment);
        }
    }
}
